"""
تابعی بنویسید که یک عدد از ورودی دریافت نماید
و  اگر عدد با صفر تمام شد
یعنی رقم یکانش اگر صفر بود
my_function(0)       =>      0th
my_function(1)       =>      1st
my_function(2)       =>      2nd
my_function(3)       =>      3rd
my_function(10)      =>      10th
my_function(11)      =>      11th
my_function(12)      =>      12th
my_function(101)      =>        101st
my_function(111)      =>        101th
my_function(14)       =>        14th
my_function(144)       =>       144th
"""
# def my_function(number):
    # """
    # با استفاده از دور روش این کار را انجام
    # یکبار با روی ریاضی دو رقم آخر را جدا کنید و سپس شر طا را می سازید

    # روش دوم : تبدیل عدد به رشته
    # و سپس جدا کردن دو رقم مورد نظر و سپس بررسی رقم ها

    # :param number:
    # :return:
    # """
    # if number % 100 in (10,11,12):
    #     return str(number)+"th"


# print(ord('a'))
# print(ord('b'))

"""
تابعی بنویسید که کلمه ای را به عنوان پارامتر دریافت نماید
و معادل عددی هر یک از کاراکترهای آن را نمایش دهد

"""

"""
تابعی بنویسید که لیستی از اعداد را به عنوان پارامتر دریافت می نماید
و عددی که بیشتر تکرار را در لیست دارد نمایش می دهد
و همینطور دومین و سومین عدد پرتکرار لیست را نیز نمایش دهد
[1,2,3,4,5,1,1,1,6,7,8,9,2,2,3]

1
2
3

"""