# TODO

"""
تابعی بنویسید که یک عدد بگیرد و ارقام آن را به صورت جداگانه نمایش دهد

تابعی بنویسید که دو عدد بگیرد و تعداد ارقام یکسان را نمایش دهد
مثلا
123  , و    234
دو رقم یکسان دارند بنابراین خروجی مساوی عدد دو می باشد.

"""

# def my_function(number):
#     while number:
#         print(number % 10)
#         number //= 10

# my_function(908)

# def my_function(number):
#     number = str(number)
#     for i in range(len(number)-1, -1, -1):
#         print(number[i])

# my_function(908)

# TODO

"""
بازی bagels
قرار است بازیکن در ده فرصت یک عدد سه رقمی را حدس بزند
اگر حدس او درست باشد
بازی با یک پیغام مناسب خاتمه می یابد
در صورت نادرست بودن حدس کاربر
پیغام مناسبی نمایش داده شود
اگر هر سه رقمی که کاربر وارد کر ده است غلط باشد
bagels
نمایش داده شود
اگر رقم درست باشد ولی سرجایش نباشد
pico
اگر رقم درست باشد و سرجایش باشد
fermi
نمایش داده شود


123

567  => bagels
367 => pico
673 => fermi
"""
